Merge & Join

In [2]:
import pandas as pd

employees = pd.DataFrame({
    "emp_id": [1, 2, 3, 4],
    "name": ["Alice", "Bob", "Charlie", "David"],
    "dept_id": [10, 20, 10, 30]
})

departments = pd.DataFrame({
    "dept_id": [10, 20, 40],
    "dept_name": ["HR", "IT", "Finance"]
})

employees.head()

   emp_id     name  dept_id
0       1    Alice       10
1       2      Bob       20
2       3  Charlie       10
3       4    David       30

In [3]:
departments.head()

   dept_id dept_name
0       10        HR
1       20        IT
2       40   Finance

Inner join two DataFrames.

In [4]:
pd.merge(employees, departments, on="dept_id", how="inner")

   emp_id     name  dept_id dept_name
0       1    Alice       10        HR
1       2      Bob       20        IT
2       3  Charlie       10        HR

Left join vs inner join â€” difference.

In [5]:
pd.merge(employees, departments, on="dept_id", how="left")

   emp_id     name  dept_id dept_name
0       1    Alice       10        HR
1       2      Bob       20        IT
2       3  Charlie       10        HR
3       4    David       30       NaN


Remove duplicates.

In [6]:
employees.drop_duplicates(subset=["emp_id"])

   emp_id     name  dept_id
0       1    Alice       10
1       2      Bob       20
2       3  Charlie       10
3       4    David       30


Concatenate DataFrames.

In [7]:
df1 = pd.DataFrame({
    "emp_id": [1, 2],
    "name": ["Alice", "Bob"]
})

df2 = pd.DataFrame({
    "emp_id": [3, 4],
    "name": ["Charlie", "David"]
})

In [8]:
df1.head()

   emp_id   name
0       1  Alice
1       2    Bob

In [9]:
df2.head()

   emp_id     name
0       3  Charlie
1       4    David

In [10]:
pd.concat([df1, df2], axis=0, ignore_index=True)

   emp_id     name
0       1    Alice
1       2      Bob
2       3  Charlie
3       4    David

In [12]:
pd.concat([df1, df2], axis=1, ignore_index=True)

   0      1  2        3
0  1  Alice  3  Charlie
1  2    Bob  4    David